backend/app/controllers/todos_controller.rb

    def create
        @todo = Todo.new(todo_params)

        if @todo.save
---
INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "do nothing"], ["completed", false], ["created_at", "2022-03-07 03:53:42.224466"], ["updated_at", "2022-03-07 03:53:42.224466"]]

    def update
        if @todo.update(todo_params)
---
UPDATE "todos" SET "completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["completed", true], ["updated_at", "2022-03-07 04:03:51.445732"], ["id", 1]]